#+TITLE:  LearnPython-WithOrg
#+AUTHOR: JohnsonLee [[mailto:0xjohnsonlee@gmail.com][Email:0xJohnsonlee@gmail.com]]
#+STARTUP: hidestars odd

**** if
    #+BEGIN_SRC python :results output :var x = -1
    if x < 0:
        print('x is negative')
    elif x == 0:
        print('x is zero')
    else:
        print('x is postive')
    #+END_SRC

    #+RESULTS:
    : x is negative

**** for
     格式: =for $(itername) in $(iterable object):=
     #+BEGIN_SRC python :results output
     words = ['cat', 'dog', 'chick']
     for w in words:
         print(w, len(w))
     #+END_SRC

     #+RESULTS:
     : ('cat', 3)
     : ('dog', 3)
     : ('chick', 5)

Code that modifies a collection while iterating over that same collection can be tricky 
to get right. Instead, it is usually more straight-forward to loop over a copy of the 
collection or to create a new collection:

#+BEGIN_SRC python
# Strategy:  Iterate over a copy
for user, status in users.copy().items():
    if status == 'inactive':
        del users[user]

# Strategy:  Create a new collection
active_users = {}
for user, status in users.items():
    if status == 'active':
        active_users[user] = status
#+END_SRC

#+BEGIN_SRC python :results output
print(range(5))
#+END_SRC

#+RESULTS:
: [0, 1, 2, 3, 4]

python的for不能直接指定循环多少次, 如何达到指定循环次数的效果
**** range函数
使用格式: range(start, stop[, step])

效果:生成一个从[start, stop)的序列, 序列的步长为c;

返回类型: range

我们可以用range+len来用索引进行循环.
#+BEGIN_SRC python :results output
a = ['Mary', 'had', 'a', 'little', 'lamb']
for i in range(len(a)):
    print(i, a[i])
#+END_SRC

#+RESULTS:
: (0, 'Mary')
: (1, 'had')
: (2, 'a')
: (3, 'little')
: (4, 'lamb')

或者可以使用enumerate()函数
#+BEGIN_SRC python :results output
a = ['Mary', 'had', 'a', 'little', 'lamb']
for i, elem in enumerate(a): # enumerate函数非常类似于golang里的range
    print(i, elem)
#+END_SRC

#+RESULTS:
: (0, 'Mary')
: (1, 'had')
: (2, 'a')
: (3, 'little')
: (4, 'lamb')

